Revit 2026 API

# FilterDoubleRule Class

---

A filter rule that operates on double-precision numeric values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterDoubleRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterDoubleRule : FilterNumericValueRule
```
```vb
Public Class FilterDoubleRule
	Inherits FilterNumericValueRule
```
```cpp
public ref class FilterDoubleRule : public FilterNumericValueRule
```
```fsharp
type FilterDoubleRule =
    class
        inherit FilterNumericValueRule
    end
```

The FilterDoubleRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterDoubleRule | Constructs an instance of FilterDoubleRule. |

|  | Name | Description |
| --- | --- | --- |
|  | Epsilon | The tolerance within which two floating-point values may be considered equal. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterRule) |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from FilterRule) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. (Inherited from FilterNumericValueRule) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from FilterRule) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. (Inherited from FilterNumericValueRule) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace